tests/reports/_res/artillery-single.txt
tests  (git)-[main]- ➤ pnpm test:load:local

> tests@1.0.0 test:load:local /Users/subhajitgorai/Codes/PROJECTS/opencanvas/tests
> artillery run load-test.yml -e local

Test run id: tc5nq_gwydg4f6fgtwgzhxxgdpencb6xgcb_75bx
Phase started: DB stress - no cache possible (index: 0, duration: 30s) 09:21:04(+0530)

--------------------------------------
Metrics for period to: 09:21:10(+0530) (width: 4.896s)
--------------------------------------

http.codes.200: ................................................................ 350
http.downloaded_bytes: ......................................................... 4535498
http.request_rate: ............................................................. 76/sec
http.requests: ................................................................. 350
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 135
  mean: ........................................................................ 3.5
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 41.7
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 135
  mean: ........................................................................ 3.5
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 41.7
http.responses: ................................................................ 350
vusers.completed: .............................................................. 241
vusers.created: ................................................................ 241
vusers.created_by_name.Cursor pagination stress: ............................... 109
vusers.created_by_name.True cache miss - unique limit per request: ............. 132
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.7
  max: ......................................................................... 160.4
  mean: ........................................................................ 10.2
  median: ...................................................................... 6.4
  p95: ......................................................................... 22
  p99: ......................................................................... 92.8


--------------------------------------
Metrics for period to: 09:21:20(+0530) (width: 9.972s)
--------------------------------------

http.codes.200: ................................................................ 750
http.downloaded_bytes: ......................................................... 9046586
http.request_rate: ............................................................. 75/sec
http.requests: ................................................................. 750
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 18
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 18
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 750
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Cursor pagination stress: ............................... 250
vusers.created_by_name.True cache miss - unique limit per request: ............. 250
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 37.2
  mean: ........................................................................ 5.6
  median: ...................................................................... 5.4
  p95: ......................................................................... 7.8
  p99: ......................................................................... 12.6


Phase completed: DB stress - no cache possible (index: 0, duration: 30s) 09:21:34(+0530)

--------------------------------------
Metrics for period to: 09:21:30(+0530) (width: 9.973s)
--------------------------------------

http.codes.200: ................................................................ 733
http.downloaded_bytes: ......................................................... 9204518
http.request_rate: ............................................................. 74/sec
http.requests: ................................................................. 733
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 1.7
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 1.7
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 733
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Cursor pagination stress: ............................... 233
vusers.created_by_name.True cache miss - unique limit per request: ............. 267
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 24.7
  mean: ........................................................................ 5.2
  median: ...................................................................... 5
  p95: ......................................................................... 7.2
  p99: ......................................................................... 10.7


--------------------------------------
Metrics for period to: 09:21:40(+0530) (width: 5.26s)
--------------------------------------

http.codes.200: ................................................................ 398
http.downloaded_bytes: ......................................................... 4641858
http.request_rate: ............................................................. 78/sec
http.requests: ................................................................. 398
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 1.6
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 1.6
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 398
vusers.completed: .............................................................. 259
vusers.created: ................................................................ 259
vusers.created_by_name.Cursor pagination stress: ............................... 139
vusers.created_by_name.True cache miss - unique limit per request: ............. 120
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.9
  max: ......................................................................... 7.5
  mean: ........................................................................ 5.1
  median: ...................................................................... 5.1
  p95: ......................................................................... 6.6
  p99: ......................................................................... 6.9


All VUs finished. Total time: 31 seconds

--------------------------------
Summary report @ 09:21:36(+0530)
--------------------------------

http.codes.200: ................................................................ 2231
http.downloaded_bytes: ......................................................... 27428460
http.request_rate: ............................................................. 76/sec
http.requests: ................................................................. 2231
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 135
  mean: ........................................................................ 2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 6
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 135
  mean: ........................................................................ 2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 6
http.responses: ................................................................ 2231
vusers.completed: .............................................................. 1500
vusers.created: ................................................................ 1500
vusers.created_by_name.Cursor pagination stress: ............................... 731
vusers.created_by_name.True cache miss - unique limit per request: ............. 769
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 160.4
  mean: ........................................................................ 6.1
  median: ...................................................................... 5.3
  p95: ......................................................................... 8.6
  p99: ......................................................................... 21.5