tests/reports/_res/autocannon-cluster.txt
tests  (git)-[main]- ➤ npx autocannon -c 50 -d 30 "http://localhost:3000/articles"
Running 30s test @ http://localhost:3000/articles
50 connections


┌─────────┬──────┬───────┬───────┬───────┬──────────┬─────────┬────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev   │ Max    │
├─────────┼──────┼───────┼───────┼───────┼──────────┼─────────┼────────┤
│ Latency │ 4 ms │ 10 ms │ 20 ms │ 26 ms │ 10.34 ms │ 5.72 ms │ 234 ms │
└─────────┴──────┴───────┴───────┴───────┴──────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼─────────┼─────────┤
│ Req/Sec   │ 1,782   │ 1,782   │ 4,747   │ 5,647   │ 4,612.34 │ 881.99  │ 1,782   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼─────────┼─────────┤
│ Bytes/Sec │ 16.1 MB │ 16.1 MB │ 42.8 MB │ 50.9 MB │ 41.6 MB  │ 7.95 MB │ 16.1 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

138k requests in 30.02s, 1.25 GB read
tests  (git)-[main]- ➤ npx autocannon -c 100 -d 30 "http://localhost:3000/articles"
Running 30s test @ http://localhost:3000/articles
100 connections


┌─────────┬──────┬───────┬───────┬───────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5% │ 99%   │ Avg      │ Stdev    │ Max    │
├─────────┼──────┼───────┼───────┼───────┼──────────┼──────────┼────────┤
│ Latency │ 7 ms │ 21 ms │ 53 ms │ 79 ms │ 23.77 ms │ 16.56 ms │ 575 ms │
└─────────┴──────┴───────┴───────┴───────┴──────────┴──────────┴────────┘
┌───────────┬───────┬───────┬─────────┬─────────┬──────────┬─────────┬───────┐
│ Stat      │ 1%    │ 2.5%  │ 50%     │ 97.5%   │ Avg      │ Stdev   │ Min   │
├───────────┼───────┼───────┼─────────┼─────────┼──────────┼─────────┼───────┤
│ Req/Sec   │ 1,774 │ 1,774 │ 4,331   │ 4,915   │ 4,120.04 │ 841.89  │ 1,774 │
├───────────┼───────┼───────┼─────────┼─────────┼──────────┼─────────┼───────┤
│ Bytes/Sec │ 16 MB │ 16 MB │ 39.1 MB │ 44.3 MB │ 37.1 MB  │ 7.59 MB │ 16 MB │
└───────────┴───────┴───────┴─────────┴─────────┴──────────┴─────────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 30

124k requests in 30.03s, 1.11 GB read
tests  (git)-[main]- ➤